#include <stdbool.h>
#include <stdio.h>
int choice; //  เลือกเมนู
int choice_menu, code;
bool condition = true;
int check; // เช็คการกรอกข้อมูลตัวหนังสือ ถ้าเจอตัวหนังสือก็จะloop จนกว่า จะกรอกตัวเลข
int coin1 = 0 ,coin5 = 0 , coin10 = 0 , Bill20 = 0 ,Bill50 = 0 ,Bill100 = 0 ,Bill500 =0 ,Bill1000 = 0  ;  // ตัวแปรเงิน
//////////////////////////////////////////////////////////////////////////////////
int main() {
  printf("welcome to ตู้ตะพาบบิน \n");

  while (condition) {
    printf("คุรต้องการสินค้าไหม Yes = (1) / No = (2) ");
    check = scanf("%d", &choice);

    if (check == 0) {
      printf("กรอก 1 / 2 เท่านั้น \n");
      while (getchar() != '\n')
        ;
    }

    else if (choice == 1) {
      printf("ต้องการน้ำหรือของทานเล่น เครื่องดื่ม = 1/ของทานเล่น = 2  / ยกเลิก = 3\n");
      scanf("%d", &choice_menu);
//////////////////////////////////////////////////////////////////////////////////
      if (choice_menu == 1) {
        printf("หมวดเครื่องดื่ม\n  %s  \n", "-------------------");
        printf("โค้ก กระป๋องละ 10 บาท (1) \t");
        printf("น้ำเขียว ขวดละ 12 บาท (2) \t");
        printf("อเมริกาโน่ แก้วละ 30 บาท(3) \t");
        printf("ลาเต้ แก้วละ 35 บาท (4) \n");
        printf(" %s  \n", "-------------------");
        printf("โปรดกรอกหมายเลขสินค้า\n");
        scanf("%d", &code);
//////////////////////////////////////////////////////////////////////////////////
        if (code == 1) {
          printf("คุณได้เลือกโค้ก กระป๋องละ 10 บาท\n");
          printf(" %s  \n", "-------------------");
          printf("ป้อนจำนวนสินค้าที่ต้องการ\n");
          int num1 = 0;
          int del1 = 0;
          scanf("%d", &num1);
          printf("ป้อนจำนวนสินค้าที่ต้องการ ** ยกเลิก **\n");
          scanf("%d", &del1);
          num1 = num1 - del1;
          if (num1 <= 0) {
            printf("คุณไม่สามารถทำรายการได้ \n %s,\n", "-------------------");
          } else {
            printf("คุณได้เลือกโค้ก %d กระป๋อง\n", num1);
            printf(" %s  \n", "-------------------");
            printf("คุณต้องการสินค้าอื่นไหม");
            printf(" %s  \n", "-------------------");
            continue;
          }
 //////////////////////////////////////////////////////////////////////////////////
        } else if (code == 2) {
          printf("คุณได้เลือกน้ำเขียว ขวดละ 12 บาท\n");
          printf(" %s  \n", "-------------------");
          printf("ป้อนจำนวนสินค้าที่ต้องการ\n");
          int num2 = 0;
          int del2 = 0;
          scanf("%d", &num2);
          printf("ป้อนจำนวนสินค้าที่ต้องการ ** ยกเลิก **\n");
          scanf("%d", &del2);
          num2 = num2 - del2;
          if (num2 <= 0) {
            printf("คุณไม่สามารถทำรายการได้ \n %s,\n", "-------------------");
          } else {
            printf("คุณได้เลือกน้ำเขียว %d กระป๋อง\n", num2);
            printf(" %s  \n", "-------------------");
            printf("คุณต้องการสินค้าอื่นไหม");
            printf(" %s  \n", "-------------------");
            continue;
          }
        }
//////////////////////////////////////////////////////////////////////////////////
        else if (code == 3) {
          printf("คุณได้เลือกอเมริกาโน่ แก้วละ 30 บาท\n");
          printf(" %s  \n", "-------------------");
          printf("ป้อนจำนวนสินค้าที่ต้องการ\n");
          int num3 = 0;
          int del3 = 0;
          scanf("%d", &num3);
          printf("ป้อนจำนวนสินค้าที่ต้องการ ** ยกเลิก **\n");
          scanf("%d", &del3);
          num3 = num3 - del3;
          if (num3 <= 0) {
            printf("คุณไม่สามารถทำรายการได้ \n %s,\n", "-------------------");
          } else {
            printf("คุณได้เลือกอเมริกาโน่ %d แก้ว\n", num3);
            printf(" %s  \n", "-------------------");
            printf("คุณต้องการสินค้าอื่นไหม");
            printf(" %s  \n", "-------------------");
            continue;
          }
//////////////////////////////////////////////////////////////////////////////////
        } else if (code == 4) {
          printf("คุณได้เลือกลาเต้ แก้วละ 30 บาท\n");
          printf(" %s  \n", "-------------------");
          printf("ป้อนจำนวนสินค้าที่ต้องการ\n");
          int num4 = 0;
          int del4 = 0;
          scanf("%d", &num4);
          printf("ป้อนจำนวนสินค้าที่ต้องการ ** ยกเลิก **\n");
          scanf("%d", &del4);
          num4 = num4 - del4;
          if(num4 <= 0){
            printf("คุณไม่สามารถทำรายการได้ \n %s,\n","-------------------");
          }
          else{
          printf("คุณได้เลือกลาเต้ %d แก้ว\n", num4);
          printf(" %s  \n", "-------------------");
          printf("คุณต้องการสินค้าอื่นไหม");
          printf(" %s  \n", "-------------------");
          continue;
          }
        }
//////////////////////////////////////////////////////////////////////////////////
      } else if (choice_menu == 2) {
        printf("Exit \n");
        condition = false;
      }

      else if (choice_menu == 0) {
        printf("ยกเลิกรายการ");

      }

      else {
        printf("สามารถกรอก 1 / 2 ได้เท่านั้น\n");
      }

    }

    else if (choice == 2) {

      printf("Exit  \n");
      condition = false;
    } else {
      printf("สามารถกรอก 1 / 2 ได้เท่านั้น\n");
    }
  }
  return 0;
}
